# Abstract Class
## 클래스는 크게 일반 클래스(흔하게 사용하는)와 추상 클래스로 나눕니다. 추상클래스는 클래스 내에 추상 메소드가 하나 이상 포함되는 경우를 말합니다.
## 추상 메소드의 선언은 다음과 같습니다. abstract void methodName();
## 메소드의 선언 후에 세미콜른(;)만을 찍어 이를 선언만 하고  자식클래스에서 구현합니다.
## 추상 클래스도 인터페이스처럼 추상클래스가 아닌 클래스에서 상속을 받는다면 추상 메소드가 있을 경우 모두 구현해주어야 합니다.
## 물론 추상클래스에서 추상클래스를 상속받는다면 모두 구현하지 않아도 됩니다.
## 자바는 오로지 단일 상속만을 지원, 추상클래스를 상속받는 클래스는 다른 클래스를 상속받을 수 없습니다.
## 추상클래스의 궁극적인 목적은 상속하기 위함입니다.
## 추상클래스는 엄연한 클래스로 이를 구현하는 것은 '상속(extends)'입니다.
# Interface
## 인터페이스는 구현체 없이, 메소드에 대한 명세만 되어있습니다.
## 인터페이스를 상속받는 클래스에서는 반드시 인터페이스에 있는 메소드를 다 구현해야 합니다.
## 인터페이스를 쓰는 가장 큰 이유는 다중상속을 지원하지 않는 자바에서 다중상속의 장점을 가져오기 위해서 입니다.
## 다중상속이 가지는 단점은 배제하고 오직 장점만을 취하기 위해 인터페이스를 쓰는 것입니다.
## 인터페이스는 '구현(implements)'라는 키워드를 통해 구현합니다.
